{
    "landing": {
        "subtitle": "Software Engineering Student"
    },
    "bio": {
        "title": "About Me",
        "text": "I'm a software engineering student located in Montreal, Quebec. I have a great passion and experience for Web development, from Front-End to Back-End. My favorite programming language has always been JavaScript (more specifically, TypeScript) and I always get excited to try out new technologies to build something amazing! I love to learn new things and I'm always looking for ways to improve myself, such as self learning by trying them out, taking an online course or participating in a CTF.\n\nI am also a big Star Wars fan. Whenever a new series or season comes out, I'll be first to watch it! I love EDM music and my favorite artist is Illenium. I like putting some good jam on to fuel my coding fingers! I am also a huge dog lover and am the proud owner of an adorable Soft Coated Wheaten Terrier named \"Kingsley\"!"
    },
    "skills": {
        "title": "Skills",
        "text": "Here's a list of my technical skills. I specialize in Web technologies, but I've learned a thing or two about other fields while I was in school and in past job experiences.",
        "group": {
            "web": "Web",
            "application": "Application",
            "database": "Database",
            "cloud": "Cloud",
            "other": "Other"
        },
        "proficiency": {
            "1": "Beginner - Tipped my toe in the water.",
            "2": "Intermediate - I've learned a thing or two.",
            "3": "Advanced - I can handle projects with this!",
            "4": "Expert - I'm a ninja!",
            "5": "Master - I eat this every day!"
        }
    },
    "projects": {
        "title": "Projects",
        "text": "Here's a few of the projects I've worked on. You can see the full list on my <0>{{github}}</0> profile, but these are the ones I am most proud of. Even if some of these were eventually left unfinished (like most my repos, oops!), I still learned a lot from them.",
        "short": {
            "nuclui": "A React UI framework, built with TypeScript, to make your developement easier so you can give more focus on your app and less on the design!",
            "genft": "Generate NFT collections by composing multiple layers together.",
            "intellibot": "The ultimate multipurpose Discord bot.",
            "punchbot": "Minimalist Discord bot to keep track of time worked on projects.",
            "codelock": "Minecraft plugin to lock entities with an \"enter and forget\" code lock. Inspired by Rust's code lock.",
            "tinderbullseye": "Find the people who liked you on Tinder, without Gold. (Patched by Tinder)",
            "react": "Have an audio visualizer as your desktop wallpaper. Includes 100+ customizable options.",
            "cuisto": "Restaurant system to manage inventory, suppliers and orders."
        }
    },
    "experience": {
        "title": "Experience",
        "text": "Here's an overview of my past experiences as a developer. Before starting to work in this field, while I was just starting as a student, I worked two and a half years as a cashier at Canada's renowned coffee shop, Tim Horton's.",
        "jobs": {
            "desjardins": {
                "description": "The Desjardins Group is a Canadian financial services cooperative and the largest federation of credit unions in North America.",
                "position": "IT Security Advisor Intern"
            },
            "ipnos": {
                "description": "Ipnos is a leading wellness app development studio. They're the creator of the sleep & relaxation app BetterSleep (formerly Relax Melodies).",
                "position": "Full-Stack Developer Intern",
                "points": [
                    "Create a rich user interface in a Web app environment using Angular.",
                    "Create Back-End services using cloud functions that are used by the Web app.",
                    "Research and analyze the feasability of new development projects."
                ]
            },
            "comact": {
                "name": "Comact", 
                "description": "Comact designs and manufactures sawmill and planer mill equipment. They offer the most comprehensive range of products on the market.",
                "position": [
                    "Front-End Developer Intern (University)",
                    "Front-End Developer",
                    "Front-End Developer Intern (Cegep)"
                ],
                "points": [
                    [
                        "Create helpful tools to generate data and send it to an artificial intelligence system.",
                        "Upgrade technologies to the latest version and implement their new features."
                    ],
                    [
                        "Validate client user interface requirements.",
                        "Evaluate the impact of needs across available systems."
                    ],
                    [
                        "Maintain and improve the current web applications using React.",
                        "Create new web applications using React.",
                        "Apply Agile development practices."
                    ]
                ]
            }
        }
    },
    "education": {
        "title": "Education",
        "text": "The following shows all the schools and courses I've taken relevant to my software developement career.",
        "name": {
            "bengse": "Bachelor of Engineering, Software Engineering",
            "compsci": "Computer Science",
            "angular": "Angular - The Complete Guide",
            "python": "Complete Python 3 Bootcamp",
            "react": "The Complete React Web Developer Course",
            "node": "The Complete Node.js Developer Course"
        },
        "type": {
            "university": "University",
            "college": "College",
            "online": "Online Course"
        }
    }
}
